# -*- coding: utf-8 -*-

from tests.base import BaseTestCase
from models.classifier import Classifier


class ClassifierTestCase(BaseTestCase):
    def test_cut(self):
        cases = [("工信处女干事每月经过下属科室都要亲口交代24口交换机等技术性器件的安装工作",
                  [('工信处', 0, 3),
                   ('女干事', 3, 6),
                   ('每月', 6, 8),
                   ('经过', 8, 10),
                   ('下属', 10, 12),
                   ('科室', 12, 14),
                   ('都', 14, 15),
                   ('要', 15, 16),
                   ('亲口', 16, 18),
                   ('交代', 18, 20),
                   ('24', 20, 22),
                   ('口', 22, 23),
                   ('交换机', 23, 26),
                   ('等', 26, 27),
                   ('技术性', 27, 30),
                   ('器件', 30, 32),
                   ('的', 32, 33),
                   ('安装', 33, 35),
                   ('工作', 35, 37)]),
                 ('今天看了《后汉书》',
                  [('今天', 0, 2),
                   ('看', 2, 3),
                   ('了', 3, 4),
                   ('《后汉书》', 4, 9), ]),
                 ('"你好"', [('"你好"', 0, 4)]),
                 ("'你好'", [("'你好'", 0, 4)]),
                 ('他说：“我是海贼王！”',
                  [('他', 0, 1),
                   ('说：', 1, 3),
                   ('“我', 3, 5),
                   ('是', 5, 6),
                   ('海贼王！”', 6, 11)]),
                 ("!", [('!', 0, 1)]),
                 ("好！", [('好！', 0, 2)]),
                 ('"《后汉书》"', [('"《后汉书》"', 0, 7)])
                 ]
        cls = Classifier()
        for case in cases:
            res = cls.cut_from_text(case[0])
            self.assertEqual(len(case[1]), len(res))
            self.assertListEqual(case[1], res)
